Revit 2026 API

# UnitFormatUtils Class

---

A utility class for formatting and parsing numbers with units.

SystemObject Autodesk.Revit.DBUnitFormatUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class UnitFormatUtils
```
```vb
Public NotInheritable Class UnitFormatUtils
```
```cpp
public ref class UnitFormatUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type UnitFormatUtils = class end
```

The UnitFormatUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Format(Units, ForgeTypeId, Double, Boolean) | Formats a number with units into a string. |
|  | Format(Units, ForgeTypeId, Double, Boolean, FormatValueOptions) | Formats a number with units into a string. |
|  | TryParse(Units, ForgeTypeId, String, Double) | Parses a formatted string into a number with units if possible. |
|  | TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double) | Parses a formatted string into a number with units if possible. |
|  | TryParse(Units, ForgeTypeId, String, Double, String) | Parses a formatted string into a number with units if possible. |
|  | TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double, String) | Parses a formatted string into a number with units if possible. |

#### Reference

Autodesk.Revit.DB Namespace